openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Fls.c
/* -------------------------------- Arctic Core ------------------------------
 * Arctic Core - the open source AUTOSAR platform http://arccore.com
 *
 * Copyright (C) 2009  ArcCore AB <contact@arccore.com>
 *
 * This source code is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License version 2 as published by the
 * Free Software Foundation; See <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 * or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
 * for more details.
 * -------------------------------- Arctic Core ------------------------------*/








/**
 * @file Fls.c
 * @breif Autosar Flash driver for Freescale MPC55xx.
 */


/*
 * IMPLEMENTATION NOTES
 * - It seems that the Autosar specification is not consistent. For
 *   FLS_AC_LOAD_ON_JOB_START == STD_ON it seems that the driver suddenly
 *   becomes blocking.
 *
 */

/*
 * Use cases:
 * 1. Bootloader, self replace
 * 2. Bootloader, application loading
 *
 * In case 2 it's very straight forward and you can just use all the functions
 * as intended. In case 1. there are some problems understanding how Autosar
 * want to implement it. What is given from spec is.
 * - If FLS_AC_LOAD_ON_JOB_START == STD_ON we copy the flash access routines
 *   to RAM( to FlsAcErase and FlsAcWrite ).
 *
 * Strange things:
 * - What happens to all the other functions that is needed to get the status
 *   for the flash driver. Did the driver just get blocking ??
 *
 */

#include "Fls.h"
/* Freescale driver */
#include "ssd_types.h"
#include "ssd_h7f.h"
#include <stdlib.h>
#include <assert.h>
#include <string.h>
#include "Det.h"
#if defined(USE_DEM)
#include "Dem.h"
#endif
#include "Cpu.h"
#include "mpc55xx.h"
#include "Fls_H7F.h"


/* Flash layout for MPC5516 */
/*
 * Low:  8x16K + 2x64k
 * Mid:  2x128K
 * High: 8x128K
 */

#define H7F_REG_BASE 			(UINT32)&FLASH
#define MAIN_ARRAY_BASE 		0x00000000

#ifdef CFG_MPC5516
#define SHADOW_ROW_BASE  		0x00FF8000
#elif defined(CFG_MPC5567)
#define SHADOW_ROW_BASE  		0x00FFFC00
#endif

#define SHADOW_ROW_SIZE 		0x00008000
#define FLASH_PAGE_SIZE    H7FB_PAGE_SIZE

#if 0
#define VFLAGS_ADDR_SECT		(1<<0)
#define VFLAGS_ADDR_PAGE		(1<<1)
#define VFLAGS_LEN_SECT			(1<<2)
#define VFLAGS_LEN_PAGE			(1<<3)

static inline int Fls_Validate( uint32 addr,uint32 length, uint32 api,uint32 rv ) {
  int i;
  int addrOk=0;
  uint32 flags_ok;
  const Fls_SectorType* sector;
  Fls_ConfigType *cfg = Fls_Global.config;

  // Pre checks.
	if( flags & VFLAGS_LEN_SECT ) {
		if( (addr + length) > FLS_TOTAL_SIZE ) {
			return (-1);
		}
	}

  for(i=0;i<cfg->FlsSectorListSize;i++) {
  	sector = &cfg->FlsSectorList[sectorIndex];
  	if( addr > (sector->FlsSectorStartaddress + sector->FlsNumberOfSectors * sector->FlsNumberOfSectors) ) {
  		continue;
  	}
  	if( flags & VFLAGS_ADDR_SECT ) {
  		if( (addr % sector->FlsSectorSize) == 0) {
  			flags &= ~VFLAGS_ADDR_SECT;
  		}
  	}
  	if( flags & VFLAGS_ADDR_PAGE ) {
  		if( (addr % sector->FlsPageSize) == 0) {
  			flags &= ~VFLAGS_ADDR_PAGE;
  		}
  	}
  	if( flags & VFLAGS_LEN_SECT ) {
  		// Check
  		if( (0!= length) && (length < sectorPtr->FlsSectorSize) ) {
  			flags &= ~VFLAGS_ADDR_SECT;
  		}
  	}
  	if( flags & VFLAGS_LEN_PAGE ) {
  		if( (0!= length) && (length < sectorPtr->FlsPageSize)) {
  			flags &= ~VFLAGS_ADDR_PAGE;
  		}
  	}
  }
}
#endif

#if ( FLS_DEV_ERROR_DETECT == STD_ON )
#define FLS_VALIDATE_PARAM_ADDRESS_SECTOR_W_RV(_addr, _api, _rv)\
  int sectorIndex;\
  int addrOk=0;\
  const Fls_SectorType* sector;\
  for (sectorIndex=0; sectorIndex<Fls_Global.config->FlsSectorListSize;sectorIndex++) {\
    sector = &Fls_Global.config->FlsSectorList[sectorIndex];\
    if((((uint32)_addr-sector->FlsSectorStartaddress) / sector->FlsSectorSize)<sector->FlsNumberOfSectors){\
      /* Within the right adress space */\
      if (!(((uint32)_addr-sector->FlsSectorStartaddress) % sector->FlsSectorSize)){\
        /* Address is correctly aligned */\
        addrOk=1;\
        break;\
      }\
    }\
  }\
  if (1!=addrOk){\
  Det_ReportError(MODULE_ID_FLS,0,_api,FLS_E_PARAM_ADDRESS ); \
  return _rv; \
  }

#define FLS_VALIDATE_PARAM_ADDRESS_PAGE_W_RV(_addr, _api, _rv)\
  int sectorIndex;\
  int addrOk=0;\
  const Fls_SectorType* sector;\
  for (sectorIndex=0; sectorIndex<Fls_Global.config->FlsSectorListSize;sectorIndex++) {\
    sector = &Fls_Global.config->FlsSectorList[sectorIndex];\
    if((((uint32)_addr-sector->FlsSectorStartaddress) / sector->FlsSectorSize)<sector->FlsNumberOfSectors){\
      /* Within the right adress space */\
      if (!(((uint32)_addr-sector->FlsSectorStartaddress) % sector->FlsPageSize)){\
        /* Address is correctly aligned */\
        addrOk=1;\
        break;\
      }\
    }\
  }\
  if (1!=addrOk){\
  Det_ReportError(MODULE_ID_FLS,0,_api,FLS_E_PARAM_ADDRESS ); \
  return _rv; \
  }

#define FLS_VALIDATE_READ_PARAM_ADDRESS_PAGE_W_RV(_addr, _api, _rv)\
  int sectorIndex;\
  int addrOk=0;\
  const Fls_SectorType* sector;\
  for (sectorIndex=0; sectorIndex<Fls_Global.config->FlsSectorListSize;sectorIndex++) {\
    sector = &Fls_Global.config->FlsSectorList[sectorIndex];\
    if((((uint32)_addr-sector->FlsSectorStartaddress) / sector->FlsSectorSize)<sector->FlsNumberOfSectors){\
      /* Within the right adress space */\
        addrOk=1;\
    }\
  }\
  if (1!=addrOk){\
  Det_ReportError(MODULE_ID_FLS,0,_api,FLS_E_PARAM_ADDRESS ); \
  return _rv; \
  }

#define FLS_VALIDATE_PARAM_LENGTH_PAGE_W_RV(_addr, _length, _api, _rv)\
  int i;\
  int lengthOk=0;\
  const Fls_SectorType* sectorPtr= &Fls_Global.config->FlsSectorList[0];\
  for (i=0; i<Fls_Global.config->FlsSectorListSize;i++) {\
    if ((sectorPtr->FlsSectorStartaddress + (sectorPtr->FlsNumberOfSectors * sectorPtr->FlsSectorSize))>=(uint32_t)(_addr+(_length))){\
      if ((0!=_length)&&!(_length % sectorPtr->FlsPageSize)){\
        lengthOk=1;\
        break;\
      }\
    }\
    sectorPtr++;\
  }\
  if (!lengthOk){\
    Det_ReportError(MODULE_ID_FLS,0,_api,FLS_E_PARAM_LENGTH ); \
    return _rv; \
  }

#define FLS_VALIDATE_READ_PARAM_LENGTH_PAGE_W_RV(_addr, _length, _api, _rv)\
  int i;\
  int lengthOk=0;\
  const Fls_SectorType* sectorPtr= &Fls_Global.config->FlsSectorList[0];\
  for (i=0; i<Fls_Global.config->FlsSectorListSize;i++) {\
    if ((sectorPtr->FlsSectorStartaddress + (sectorPtr->FlsNumberOfSectors * sectorPtr->FlsSectorSize))>=(uint32_t)(_addr+(_length))){\
    	lengthOk=1;\
    }\
    sectorPtr++;\
  }\
  if (!lengthOk){\
    Det_ReportError(MODULE_ID_FLS,0,_api,FLS_E_PARAM_LENGTH ); \
    return _rv; \
  }

#define FLS_VALIDATE_PARAM_LENGTH_SECTOR_W_RV(_addr, _length, _api, _rv)\
  int i;\
  int lengthOk=0;\
  const Fls_SectorType* sectorPtr= &Fls_Global.config->FlsSectorList[0];\
  for (i=0; i<Fls_Global.config->FlsSectorListSize;i++) {\
    if ((sectorPtr->FlsSectorStartaddress + (sectorPtr->FlsNumberOfSectors * sectorPtr->FlsSectorSize))>=(uint32_t)(_addr+(_length))){\
      if ((0!=_length)&& !(_length % sectorPtr->FlsSectorSize)){\
        lengthOk=1;\
        break;\
      }\
    }\
    sectorPtr++;\
  }\
  if (!lengthOk){\
    Det_ReportError(MODULE_ID_FLS,0,_api,FLS_E_PARAM_LENGTH ); \
    return _rv; \
  }

#define FLS_VALIDATE_STATUS_UNINIT_W_RV(_status, _api, _rv)\
  if (MEMIF_UNINIT == _status){\
    Det_ReportError(MODULE_ID_FLS,0,_api,FLS_E_UNINIT); \
    return _rv; \
  }

#define FLS_VALIDATE_STATUS_BUSY(_status, _api)\
  if (MEMIF_BUSY == _status){\
    Det_ReportError(MODULE_ID_FLS,0,_api,FLS_E_BUSY); \
    return; \
  }

#define FLS_VALIDATE_STATUS_BUSY_W_RV(_status, _api, _rv)\
  if (MEMIF_BUSY == _status){\
    Det_ReportError(MODULE_ID_FLS,0,_api,FLS_E_BUSY); \
    return _rv; \
  }

#define FLS_VALIDATE_PARAM_DATA_W_RV(_ptr,_api, _rv) \
  if( (_ptr)==((void *)0)) { \
    Det_ReportError(MODULE_ID_FLS,0,_api,FLS_E_PARAM_DATA); \
    return _rv; \
  }
#else
  #define FLS_VALIDATE_PARAM_ADDRESS_SECTOR_W_RV(_addr, _api, _rv)
  #define FLS_VALIDATE_PARAM_ADDRESS_PAGE_W_RV(_addr, _api, _rv)
  #define FLS_VALIDATE_READ_PARAM_ADDRESS_PAGE_W_RV(_addr, _api, _rv)
  #define FLS_VALIDATE_PARAM_LENGTH_SECTOR_W_RV(_addr, _length, _api, _rv)
  #define FLS_VALIDATE_PARAM_LENGTH_PAGE_W_RV(_addr, _length, _api, _rv)
  #define FLS_VALIDATE_READ_PARAM_LENGTH_PAGE_W_RV(_addr, _length, _api, _rv)
  #define FLS_VALIDATE_STATUS_UNINIT_W_RV(_status, _api, _rv)
  #define FLS_VALIDATE_STATUS_BUSY(_status, _api)
  #define FLS_VALIDATE_STATUS_BUSY_W_RV(_status, _api, _rv)
  #define FLS_VALIDATE_PARAM_DATA_W_RV(_ptr,_api,_rv)
#endif

