openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Fls.c
#if ( FLS_DEV_ERROR_DETECT == STD_ON )
#define DET_REPORTERROR(_x,_y,_z,_q) Det_ReportError(MODULE_ID_FLS, _y, _z, _q)
#else
#define DET_REPORTERROR(_x,_y,_z,_q)
#endif

#if ( FLS_GET_JOB_RESULT_API == STD_ON)
#define FEE_JOB_END_NOTIFICATION() \
  if( Fls_Global.config->FlsJobEndNotification != NULL ) { \
    Fls_Global.config->FlsJobEndNotification(); \
  }
#define FEE_JOB_ERROR_NOTIFICATION() \
  if( Fls_Global.config->FlsJobErrorNotification != NULL ) { \
    Fls_Global.config->FlsJobErrorNotification(); \
  }
#else
#define FEE_JOB_END_NOTIFICATION()
#define FEE_JOB_ERROR_NOTIFICATION()
#endif



/**
 * Get PC.
 * Since you can't read the PC on PPC, do the next best thing.
 * Ensure that the function is not inlined
 */
static uint32 Fls_GetPc( void ) __attribute__ ((noinline));

static uint32 Fls_GetPc( void )
{
  return get_spr(SPR_LR);
}


typedef struct {
  uint32 addr;
  uint32 size;
} Fls_InternalSectorType;


SSD_CONFIG ssdConfig = {
    H7F_REG_BASE,           /* H7F control register base */
    MAIN_ARRAY_BASE,        /* base of main array */
    0,                      /* size of main array */
    SHADOW_ROW_BASE,        /* base of shadow row */
    SHADOW_ROW_SIZE,        /* size of shadow row */
    0,                      /* block number in low address space */
    0,                      /* block number in middle address space */
    0,                      /* block number in high address space */
    8,        				/* page size */
    FALSE,                   /* debug mode selection */
};

static Std_VersionInfoType _Fls_VersionInfo = {
    .vendorID 			= (uint16)1,
    .moduleID 			= (uint16) MODULE_ID_FLS,
    .instanceID			= (uint8)1,
    /* Vendor numbers */
    .sw_major_version	= (uint8)FLS_SW_MAJOR_VERSION,
    .sw_minor_version	= (uint8)FLS_SW_MINOR_VERSION,
    .sw_patch_version	= (uint8)FLS_SW_PATCH_VERSION,
    .ar_major_version	= (uint8)FLS_AR_MAJOR_VERSION,
    .ar_minor_version	= (uint8)FLS_AR_MINOR_VERSION,
    .ar_patch_version	= (uint8)FLS_AR_PATCH_VERSION,
};

//
typedef enum {
  FLS_JOB_NONE,
  FLS_JOB_COMPARE,
  FLS_JOB_ERASE,
  FLS_JOB_READ,
  FLS_JOB_WRITE,
} Fls_Arc_JobType;

#if 0
typedef struct {
  MemIf_StatusType    status;
  MemIf_JobResultType jobResultType;
  Fls_Arc_JobType	jobType;
  Fls_AddressType   sourceAddr;
  uint8 *targetAddr;
  Fls_LengthType length;

  Fls_ProgInfoType flashWriteInfo;

} FlsUnit_t;
#endif


#if 0
static FlsUnit_t privData = {
    .status = MEMIF_UNINIT,
    .jobResultType = MEMIF_JOB_OK,
    .jobType = FLS_JOB_NONE,

};
#endif

// Default Config
#if 0
const Fls_ConfigType * configDataPtr = &FlsConfigSet[0];
#endif

// TODO: Comment and cleanup
typedef struct {
  const Fls_ConfigType * config;
  Fls_EraseBlockType lockBits;

  MemIf_StatusType    status;
  MemIf_JobResultType jobResultType;
  Fls_Arc_JobType	jobType;
  Fls_AddressType   sourceAddr;
  uint8 *targetAddr;
  Fls_LengthType length;

  Fls_ProgInfoType flashWriteInfo;
} Fls_GlobalType;

Fls_GlobalType Fls_Global = {
    .status = MEMIF_UNINIT,
    .jobResultType = MEMIF_JOB_OK,
    .jobType = FLS_JOB_NONE,
};


#if 0
static inline uint32 rlwimi(uint32 val, uint16 sh, uint16 mb,uint16 me)
{
  uint32 result;
  asm volatile("rlwimi %0,%1,8,16,23"
          : "=r" (result)
          : "r" (val),"g" (sh), "g" (mb), "g" (me) );
  return result;
}

#define CREATE_MASK(_start,_stop) rlwimi(0xffffffff,0x0,0x0,0x10)
#endif

/**
 * Converts an address to a freescale erase block.
 * Assumes addr is located from FLS_BASE_ADDRESS
 *
 * @param addr address to convert
 * @param rem pointer to reminder that gets filled in by the function
 * @return A block number
 */

// TODO: This have hardcoded limits. Get from config instead
static uint32 address_to_block( uint32 addr, uint32 *rem ) {
  uint32 block;

  if( addr < 0x20000) {
    // Low range, 8x16K
    block = addr / 0x4000;
    *rem   = addr % 0x4000;
  } else if ( addr < 0x40000) {
    // Low range, 2x64k range
    block = 8 + ( addr - 0x20000 ) / 0x10000;
    *rem   = addr % 0x10000;
  } else if( addr < 0x80000 ) {
    // mid range
    block = 10 + ( addr - 0x40000 ) / 0x20000;
    *rem = addr % 0x20000;
  } else if( addr < 0x180000 ) {
    // high range
    block = 12 + ( addr - 0x80000 ) / 0x20000;
    *rem = addr % 0x20000;
  } else {
    block = (-1);
    *rem = (-1);
  }
  return block;
}


/**
 * Converts an address range( addr to addr + size) to freescale bit erase
 * blocks. The function adds the erase block information to eraseBlocks ptr.
 *
 * @param eraseBlocks Ptr to an erase structure
 * @param addr The start-address to convert
 * @param size The size of the block
 * @return The test results
 */
static void address_to_erase_blocks( Fls_EraseBlockType *eraseBlocks, uint32 addr, uint32 size ) {
//	EraseBlock_t eraseBlocks;
  uint32 startBlock;
  uint32 endBlock;
  uint32 mask1;
  uint32 mask2;
  uint32 mask;
  uint32 rem;

  /* Create a mask with continuous set of 1's */
  startBlock = address_to_block( addr,&rem );
  endBlock = address_to_block( addr + size - 1,&rem );

  // Check so our implementation holds..
  assert( endBlock<=32 );

#define BLOCK_MASK 0x0003ffffUL

  // create the mask
  mask1 = ((-1UL)<<(31-endBlock))>>(31-endBlock);
  mask2 = ((-1UL)>>startBlock)<<startBlock;
  mask = mask1 & mask2;


  // shift things in to make freescale driver happy
  eraseBlocks->lowEnabledBlocks = mask&0x3f; // ????
  eraseBlocks->midEnabledBlocks = (mask>>10)&3; // ????
  eraseBlocks->highEnabledBlocks = mask>>12;


  return ;
}


void Fls_Init( const Fls_ConfigType *ConfigPtr )
{
  FLS_VALIDATE_STATUS_BUSY(Fls_Global.status, FLS_INIT_ID);
  Fls_Global.status 		= MEMIF_UNINIT;
  Fls_Global.jobResultType 	= MEMIF_JOB_PENDING;
  uint32 returnCode;
  Fls_EraseBlockType eraseBlocks;
  // TODO: FLS_E_PARAM_CONFIG
  Fls_Global.config = ConfigPtr;

#if (FLS_AC_LOAD_ON_JOB_START == STD_ON )
  /* Copy fls routines to RAM */
  memcpy(__FLS_ERASE_RAM__,__FLS_ERASE_ROM__, (size_t)&__FLS_SIZE__);

#endif


  returnCode = FlashInit( &ssdConfig );

  // Lock shadow row..
  eraseBlocks.lowEnabledBlocks = 0;
  eraseBlocks.midEnabledBlocks = 0;
  eraseBlocks.highEnabledBlocks = 0;
  eraseBlocks.shadowBlocks = 1;

  Fls_H7F_SetLock(&eraseBlocks,1);

