openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Fls.c
  Fls_Global.status 		= MEMIF_IDLE;
  Fls_Global.jobResultType 	= MEMIF_JOB_OK;
  return;
}

/* TargetAddress always from 0 to FLS_TOTAL_SIZE */
Std_ReturnType Fls_Erase(	Fls_AddressType   TargetAddress,
                          Fls_LengthType    Length )
{
  uint32 block;
  uint32 sBlock;
  uint32 rem;
  Fls_EraseBlockType eraseBlock;
  Fls_EraseInfoType eraseInfo;
  uint32 pc;

  FLS_VALIDATE_STATUS_UNINIT_W_RV(Fls_Global.status, FLS_ERASE_ID, E_NOT_OK);
  FLS_VALIDATE_STATUS_BUSY_W_RV(Fls_Global.status, FLS_ERASE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_ADDRESS_SECTOR_W_RV(TargetAddress, FLS_ERASE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_LENGTH_SECTOR_W_RV(TargetAddress, Length, FLS_ERASE_ID, E_NOT_OK);

  // Always check if status is not busy
  if (Fls_Global.status == MEMIF_BUSY )
     return E_NOT_OK;

  // TargetAddress
  sBlock = address_to_block(TargetAddress,&rem);

  if( (sBlock == (-1)) || (rem!=0) ) {
    DET_REPORTERROR(MODULE_ID_FLS,0,0x0,FLS_E_PARAM_ADDRESS );
    return E_NOT_OK;
  }

  block = address_to_block(TargetAddress+Length,&rem);

  // Check if we trying to erase a partition that we are executing in
  pc = Fls_GetPc();
  if( (pc >= FLS_BASE_ADDRESS) && ( pc <= (FLS_BASE_ADDRESS + FLS_TOTAL_SIZE) ) ) {
    // In flash erase
  	uint32 pcBlock = address_to_block(pc,&rem);
  	uint8 *partMap = Fls_Global.config->FlsBlockToPartitionMap;

  	if( (partMap[pcBlock] >= partMap[sBlock]) && (partMap[pcBlock] <= partMap[block]) ) {
//    if( address_to_block(pc,&rem) == Fls_Global.config->FlsBlockToPartitionMap[block] ) {
        // Can't erase and in the same partition we are executing
        assert(0);
    }
  }

  Fls_Global.status = MEMIF_BUSY;
  Fls_Global.jobResultType = MEMIF_JOB_PENDING;
  Fls_Global.jobType = FLS_JOB_ERASE;

  address_to_erase_blocks(&eraseBlock,TargetAddress,Length);

  eraseBlock.shadowBlocks = 0;
  // Unlock
  Fls_H7F_SetLock(&eraseBlock,0);

  eraseInfo.state  = 0; // Always set this



  Fls_H7F_FlashErase ( 	&ssdConfig ,
          0, // shadowFlag...
          eraseBlock.lowEnabledBlocks,
          eraseBlock.midEnabledBlocks,
          eraseBlock.highEnabledBlocks,
          &eraseInfo
                  );
  return E_OK;
}


Std_ReturnType Fls_Write (    Fls_AddressType   TargetAddress,
                        const uint8         *SourceAddressPtr,
                        Fls_LengthType    Length )
{
  Fls_EraseBlockType eraseBlock;

  FLS_VALIDATE_STATUS_UNINIT_W_RV(Fls_Global.status, FLS_WRITE_ID, E_NOT_OK);
  FLS_VALIDATE_STATUS_BUSY_W_RV(Fls_Global.status, FLS_WRITE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_ADDRESS_PAGE_W_RV(TargetAddress, FLS_WRITE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_LENGTH_PAGE_W_RV(TargetAddress, Length, FLS_WRITE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_DATA_W_RV(SourceAddressPtr, FLS_WRITE_ID, E_NOT_OK)

  // Always check if status is not busy
  if (Fls_Global.status == MEMIF_BUSY )
     return E_NOT_OK;

  // Destination is FLS_BASE_ADDRESS + TargetAddress
  Fls_Global.jobResultType = MEMIF_JOB_PENDING;
  Fls_Global.status = MEMIF_BUSY;
  Fls_Global.jobType = FLS_JOB_WRITE;

  // Fill in the required fields for programming...
  Fls_Global.flashWriteInfo.source = (uint32)SourceAddressPtr;
  Fls_Global.flashWriteInfo.dest = TargetAddress;
  Fls_Global.flashWriteInfo.size = Length;

  // unlock flash....
  address_to_erase_blocks(&eraseBlock,TargetAddress,Length);
  eraseBlock.shadowBlocks = 0;
  Fls_H7F_SetLock(&eraseBlock,0);

  return E_OK;
}

#if ( FLS_CANCEL_API == STD_ON )
void Fls_Cancel( void )
{
	/* API NOT SUPPORTED */
}
#endif


#if ( FLS_GET_STATUS_API == STD_ON )
MemIf_StatusType Fls_GetStatus(	void )
{
  return Fls_Global.status;
}
#endif


#if ( FLS_GET_JOB_RESULT_API == STD_ON )
MemIf_JobResultType Fls_GetJobResult( void )
{
  return Fls_Global.jobResultType;
}
#endif

void Fls_MainFunction( void )
{
  uint32 flashStatus;
  int result;
  if( Fls_Global.jobResultType == MEMIF_JOB_PENDING ) {
    switch(Fls_Global.jobType) {
    case FLS_JOB_COMPARE:
      // NOT implemented. Hardware error = FLS_E_COMPARE_FAILED
      // ( we are reading directly from flash so it makes no sense )

      result = memcmp(Fls_Global.targetAddr,(void *)Fls_Global.sourceAddr,Fls_Global.length);
      if( result == 0 ) {
        Fls_Global.jobResultType = MEMIF_JOB_OK;
      } else {
        Fls_Global.jobResultType = MEMIF_JOB_FAILED;
      }
      Fls_Global.status = MEMIF_IDLE;
      Fls_Global.jobType = FLS_JOB_NONE;

      break;
    case FLS_JOB_ERASE:
    {
//      uint32 failAddress;
//      uint32 failData;

      flashStatus = Fls_H7F_EraseStatus(&ssdConfig);
      if( flashStatus == H7F_OK ) {
        Fls_EraseBlockType blocks;
        // Lock all.
        blocks.highEnabledBlocks = (-1UL);
        blocks.midEnabledBlocks = (-1UL);
        blocks.highEnabledBlocks = (-1UL);
        blocks.shadowBlocks = (-1UL);

        Fls_H7F_SetLock(&blocks,1);

        Fls_Global.jobResultType = MEMIF_JOB_OK;
        Fls_Global.jobType = FLS_JOB_NONE;
        Fls_Global.status = MEMIF_IDLE;
        FEE_JOB_END_NOTIFICATION();
      } else if( flashStatus == H7F_BUSY )  {
        /* Busy, Do nothing */
      } else {
        // Error
        Fls_Global.jobResultType = MEMIF_JOB_FAILED;
        Fls_Global.jobType = FLS_JOB_NONE;
        Fls_Global.status = MEMIF_IDLE;
#if defined(USE_DEM)
		Dem_ReportErrorStatus(FLS_E_WRITE_FAILED, DEM_EVENT_STATUS_FAILED);
#endif
        FEE_JOB_ERROR_NOTIFICATION();
      }
      break;
    }
    case FLS_JOB_READ:

      // NOT implemented. Hardware error = FLS_E_READ_FAILED
      // ( we are reading directly from flash so it makes no sense )
      memcpy(Fls_Global.targetAddr,(void *)Fls_Global.sourceAddr,Fls_Global.length);
      Fls_Global.jobResultType = MEMIF_JOB_OK;
      Fls_Global.status = MEMIF_IDLE;
      Fls_Global.jobType = FLS_JOB_NONE;
      FEE_JOB_END_NOTIFICATION();
      break;
    case FLS_JOB_WRITE:
    {
      // NOT implemented. Hardware error = FLS_E_READ_FAILED

