openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Fls.c
      flashStatus = Fls_H7F_Program( &ssdConfig,&Fls_Global.flashWriteInfo);

      if( flashStatus == H7F_OK ) {
        Fls_EraseBlockType blocks;
        blocks.highEnabledBlocks = (-1UL);
        blocks.midEnabledBlocks = (-1UL);
        blocks.highEnabledBlocks = (-1UL);
        blocks.shadowBlocks = (-1UL);

        // Lock all
        Fls_H7F_SetLock(&blocks,1);

        Fls_Global.jobResultType = MEMIF_JOB_OK;
        Fls_Global.jobType = FLS_JOB_NONE;
        Fls_Global.status = MEMIF_IDLE;
        FEE_JOB_END_NOTIFICATION();
      } else if( flashStatus == H7F_BUSY )  {
        /* Busy, Do nothing */
      } else {
        // Error
        Fls_Global.jobResultType = MEMIF_JOB_FAILED;
        Fls_Global.jobType = FLS_JOB_NONE;
        Fls_Global.status = MEMIF_IDLE;
#if defined(USE_DEM)
		Dem_ReportErrorStatus(FLS_E_WRITE_FAILED, DEM_EVENT_STATUS_FAILED);
#endif
		FEE_JOB_ERROR_NOTIFICATION();
      }

      break;
    }
    case FLS_JOB_NONE:
      assert(0);
      break;
    }
  }
}

Std_ReturnType Fls_Read (	Fls_AddressType SourceAddress,
              uint8 *TargetAddressPtr,
              Fls_LengthType Length )
{
  FLS_VALIDATE_STATUS_UNINIT_W_RV(Fls_Global.status, FLS_READ_ID, E_NOT_OK);
  FLS_VALIDATE_STATUS_BUSY_W_RV(Fls_Global.status, FLS_READ_ID, E_NOT_OK);
  FLS_VALIDATE_READ_PARAM_ADDRESS_PAGE_W_RV(SourceAddress, FLS_READ_ID, E_NOT_OK);
  FLS_VALIDATE_READ_PARAM_LENGTH_PAGE_W_RV(SourceAddress, Length, FLS_READ_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_DATA_W_RV((void*)TargetAddressPtr, FLS_READ_ID, E_NOT_OK)

  // Always check if status is not busy
  if (Fls_Global.status == MEMIF_BUSY )
     return E_NOT_OK;

  Fls_Global.status = MEMIF_BUSY;
  Fls_Global.jobResultType = MEMIF_JOB_PENDING;
  Fls_Global.jobType = FLS_JOB_READ;

  Fls_Global.sourceAddr = SourceAddress;
  Fls_Global.targetAddr = TargetAddressPtr;
  Fls_Global.length = Length;

  return E_OK;
}

#if ( FLS_COMPARE_API == STD_ON )
Std_ReturnType Fls_Compare( Fls_AddressType SourceAddress,
              uint8 *TargetAddressPtr,
              Fls_LengthType Length )
{
  FLS_VALIDATE_STATUS_UNINIT_W_RV(Fls_Global.status, FLS_COMPARE_ID, E_NOT_OK);
  FLS_VALIDATE_STATUS_BUSY_W_RV(Fls_Global.status, FLS_COMPARE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_ADDRESS_PAGE_W_RV(SourceAddress, FLS_COMPARE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_LENGTH_PAGE_W_RV(SourceAddress, Length, FLS_COMPARE_ID, E_NOT_OK);
  FLS_VALIDATE_PARAM_DATA_W_RV((void*)SourceAddress,FLS_COMPARE_ID, E_NOT_OK)

  // Always check if status is not busy
  if (Fls_Global.status == MEMIF_BUSY )
     return E_NOT_OK;

  Fls_Global.status = MEMIF_BUSY;
  Fls_Global.jobResultType = MEMIF_JOB_PENDING;
  Fls_Global.jobType = FLS_JOB_COMPARE;

  Fls_Global.sourceAddr = SourceAddress;
  Fls_Global.targetAddr = TargetAddressPtr;
  Fls_Global.length = Length;

  return E_OK;
}
#endif

#if ( FLS_SET_MODE_API == STD_ON )
void Fls_SetMode(		MemIf_ModeType Mode )
{
	/* API NOT SUPPORTED */
}
#endif

void Fls_GetVersionInfo( Std_VersionInfoType *VersioninfoPtr )
{
  memcpy(VersioninfoPtr, &_Fls_VersionInfo, sizeof(Std_VersionInfoType));
}



